■問題
社員テーブル（employee）から「山田奈美」さんの情報を取り出してみましょう。
すべての列を取り出すものとします。

■実行文
# 全列を取得
SELECT
	*
# 社員テーブルから取得
FROM
	employee
# 名前が「山田奈美」さんに当てはまる場合のみ取得
WHERE
	l_name = '山田'
	AND
	f_name = '奈美'
;


■返却値
mysql> # 全列を取得
mysql> SELECT
    -> *
    -> # 社員テーブルから取得
    -> FROM
    -> employee
    -> # 名前が「山田奈美」さんに当てはまる場合のみ取得
    -> WHERE
    -> l_name = '山田'
    -> AND
    -> f_name = '奈美'
    -> ;
+---------+--------+--------+-------------+-------------+------+-------+-----------+---------+-------------+---------+
| s_id    | l_name | f_name | l_name_kana | f_name_kana | sex  | class | depart_id | b_id    | last_update | retired |
+---------+--------+--------+-------------+-------------+------+-------+-----------+---------+-------------+---------+
| YA00001 | 山田   | 奈美   | ヤマダ      | ナミ        |    2 | 課長  | S01       | SA00001 | 2012-10-15  |       0 |
+---------+--------+--------+-------------+-------------+------+-------+-----------+---------+-------------+---------+
1 row in set (0.00 sec)