■問題文
出版社「日経BP」が既存の書籍に対して、一律の価格改定（10%オフ）をしました。
書籍情報テーブル（books）上のデータも更新してみましょう

■実行文
# 書籍情報テーブルを更新する
UPDATE
	books
# 価格を10％オフの価格に更新する
SET
	price = price * 0.9
# 出版社が日経BPの場合のみ更新する
WHERE
	publish = '日経BP'
;
■返却値
mysql> UPDATE
    -> books
    -> SET
    -> price = price * 0.9
    -> WHERE
    -> publish = '日経BP'
    -> ;
Query OK, 4 rows affected (0.06 sec)
Rows matched: 4  Changed: 4  Warnings: 0

【Before】
mysql> select * from books;
+---------------+------------------+-------+--------------+--------------+-------------+
| isbn          | title            | price | publish      | publish_date | category_id |
+---------------+------------------+-------+--------------+--------------+-------------+
| 4-0010-0000-0 | ハムスターの観察 |   818 | WINGS出版    | 2010-11-01   | Z9999       |
| 4-0010-0000-1 | PHPドリル        |  4636 | WINGS出版    | 2013-01-14   | P1111       |
| 4-0010-0000-4 | フェレットの観察 |   909 | WINGS出版    | 2012-10-26   | Z9999       |
| 4-0010-0000-5 | らくだの観察日記 |  1000 | WINGS出版    | 2012-12-24   | Z9999       |
| 4-0010-0000-6 | あひるの観察日記 |   636 | WINGS出版    | 2012-11-15   | A9999       |
| 4-0010-0000-7 | かえるの観察日記 |   727 | WINGS出版    | 2013-01-15   | H9999       |
| 4-0010-0000-9 | SQL入門          |  5000 | WINGS出版    | 2012-10-30   | S2222       |
| 4-7980-0522-3 | JSPリファレンス  |  1636 | 秀和システム | 2010-04-19   | J4444       |
| 4-7980-0945-8 | PHP5サンプル集   |  2727 | 秀和システム | 2012-11-01   | P1111       |
| 4-7981-0722-0 | XML辞典          |  3000 | 翔泳社       | 2011-09-16   | X3333       |
| 4-7981-0959-2 | PEAR入門         |  2727 | 翔泳社       | 2012-09-08   | P1111       |
| 4-8833-0000-1 | SQLリファレンス  |  2273 | 日経BP       | 2013-02-15   | S2222       |
| 4-8833-0000-2 | SQLプチブック    |  1455 | 日経BP       | 2010-11-30   | S2222       |
| 4-8833-0000-3 | XMLリファレンス  |  2909 | 日経BP       | 2012-11-24   | X3333       |
| 4-8833-0000-4 | SQLミニ          |   909 | 日経BP       | 2011-03-22   | S2222       |
+---------------+------------------+-------+--------------+--------------+-------------+
15 rows in set (0.03 sec)

【After】
mysql> select * from books;
+---------------+------------------+-------+--------------+--------------+-------------+
| isbn          | title            | price | publish      | publish_date | category_id |
+---------------+------------------+-------+--------------+--------------+-------------+
| 4-0010-0000-0 | ハムスターの観察 |   818 | WINGS出版    | 2010-11-01   | Z9999       |
| 4-0010-0000-1 | PHPドリル        |  4636 | WINGS出版    | 2013-01-14   | P1111       |
| 4-0010-0000-4 | フェレットの観察 |   909 | WINGS出版    | 2012-10-26   | Z9999       |
| 4-0010-0000-5 | らくだの観察日記 |  1000 | WINGS出版    | 2012-12-24   | Z9999       |
| 4-0010-0000-6 | あひるの観察日記 |   636 | WINGS出版    | 2012-11-15   | A9999       |
| 4-0010-0000-7 | かえるの観察日記 |   727 | WINGS出版    | 2013-01-15   | H9999       |
| 4-0010-0000-9 | SQL入門          |  5000 | WINGS出版    | 2012-10-30   | S2222       |
| 4-7980-0522-3 | JSPリファレンス  |  1636 | 秀和システム | 2010-04-19   | J4444       |
| 4-7980-0945-8 | PHP5サンプル集   |  2727 | 秀和システム | 2012-11-01   | P1111       |
| 4-7981-0722-0 | XML辞典          |  3000 | 翔泳社       | 2011-09-16   | X3333       |
| 4-7981-0959-2 | PEAR入門         |  2727 | 翔泳社       | 2012-09-08   | P1111       |
| 4-8833-0000-1 | SQLリファレンス  |  2046 | 日経BP       | 2013-02-15   | S2222       |
| 4-8833-0000-2 | SQLプチブック    |  1310 | 日経BP       | 2010-11-30   | S2222       |
| 4-8833-0000-3 | XMLリファレンス  |  2618 | 日経BP       | 2012-11-24   | X3333       |
| 4-8833-0000-4 | SQLミニ          |   818 | 日経BP       | 2011-03-22   | S2222       |
+---------------+------------------+-------+--------------+--------------+-------------+
15 rows in set (0.00 sec)

mysql>