■問題文
貸し出し記録テーブル（rental）上、returned列が9（紛失）であるレコードについて、
対応する書籍情報テーブル（books）上の分類IDを「XXXXX」（その他）に更新してみましょう。

■実行文
# 書籍情報テーブルを更新する
UPDATE
	books
# 貸し出し記録テーブル（rental）上、returned列が9（紛失）である書籍の分類IDを「XXXXX」（その他）に更新する
SET
	category_id = 'XXXXX'
WHERE
	isbn
IN
(
	SELECT
		isbn
	FROM
		rental
	WHERE
		returned = '9'
)
;


■返却値
mysql> # 書籍情報テーブルを更新する
mysql> UPDATE
    -> books
    -> # 貸し出し記録テーブル（rental）上、returned列が9（紛失）である書籍の分類IDを「XXXXX」（その他）に更新する
    -> SET
    -> category_id = 'XXXXX'
    -> WHERE
    -> isbn
    -> IN
    -> (
    -> SELECT
    -> isbn
    -> FROM
    -> rental
    -> WHERE
    -> returned = '9'
    -> )
    -> ;
Query OK, 2 rows affected (0.07 sec)
Rows matched: 2  Changed: 2  Warnings: 0

【Before】
mysql> select isbn,title,category_id from books;
+---------------+------------------------+-------------+
| isbn          | title                  | category_id |
+---------------+------------------------+-------------+
| 4-0010-0000-0 | ハムスターの観察未分類 | Z9999       |
| 4-0010-0000-1 | PHPドリルPHP           | P1111       |
| 4-0010-0000-4 | フェレットの観察未分類 | Z9999       |
| 4-0010-0000-5 | らくだの観察日記未分類 | Z9999       |
| 4-0010-0000-6 | あひるの観察日記       | A9999       |
| 4-0010-0000-7 | かえるの観察日記       | H9999       |
| 4-0010-0000-9 | SQL入門SQL             | S2222       |
| 4-7980-0522-3 | JSPリファレンスJava    | J4444       |
| 4-7980-0945-8 | PHP5サンプル集PHP      | P1111       |
| 4-7981-0722-0 | XML辞典XML             | X3333       |
| 4-7981-0959-2 | PEAR入門PHP            | P1111       |
| 4-8833-0000-1 | SQLリファレンスSQL     | S2222       |
| 4-8833-0000-2 | SQLプチブックSQL       | S2222       |
| 4-8833-0000-3 | XMLリファレンスXML     | X3333       |
| 4-8833-0000-4 | SQLミニSQL             | S2222       |
+---------------+------------------------+-------------+
15 rows in set (0.00 sec)

【After】
mysql>  select isbn,title,category_id from books;
+---------------+------------------------+-------------+
| isbn          | title                  | category_id |
+---------------+------------------------+-------------+
| 4-0010-0000-0 | ハムスターの観察未分類 | XXXXX       |
| 4-0010-0000-1 | PHPドリルPHP           | P1111       |
| 4-0010-0000-4 | フェレットの観察未分類 | Z9999       |
| 4-0010-0000-5 | らくだの観察日記未分類 | Z9999       |
| 4-0010-0000-6 | あひるの観察日記       | A9999       |
| 4-0010-0000-7 | かえるの観察日記       | H9999       |
| 4-0010-0000-9 | SQL入門SQL             | S2222       |
| 4-7980-0522-3 | JSPリファレンスJava    | J4444       |
| 4-7980-0945-8 | PHP5サンプル集PHP      | P1111       |
| 4-7981-0722-0 | XML辞典XML             | X3333       |
| 4-7981-0959-2 | PEAR入門PHP            | P1111       |
| 4-8833-0000-1 | SQLリファレンスSQL     | S2222       |
| 4-8833-0000-2 | SQLプチブックSQL       | XXXXX       |
| 4-8833-0000-3 | XMLリファレンスXML     | X3333       |
| 4-8833-0000-4 | SQLミニSQL             | S2222       |
+---------------+------------------------+-------------+
15 rows in set (0.03 sec)