■問題文
社員テーブル（employee）とタイムカードテーブル（time_card）から
氏名と２０１２年１２月の勤務時間を、社員コード、日付について昇順で出力してみましょう。
空欄を埋めて、SQL命令を完成させましょう。
SELECT
	[空欄①]
FROM
	employee AS e
[空欄②]
	time_card AS t
ON
	[空欄③]
WHERE
	t.r_date [空欄④] '2012-12-01' [空欄⑤] '2012-12-31'
ORDER BY
	e.s_id ASC,
	t.r_date ASC
;
■実行文
# 対象のテーブルから社員コード、氏名、日付を出力
SELECT
	e.s_id AS 社員コード,
	CONCAT(e.l_name, e.f_name) AS 氏名,
	t.r_date AS 日付
# 対象のテーブルは社員テーブルにタイムカードテーブルを内部結合したもの
FROM
	employee AS e
INNER JOIN
	time_card AS t
# 社員テーブルにタイムカードテーブルを内部結合する条件は社員コードが一致すること
ON
	e.s_id = t.s_id
# 日付が2012年12月のデータのみ出力
WHERE
	t.r_date >= '2012-12-01' AND  t.r_date <= '2012-12-31'
# 社員コード、日付について昇順で出力
ORDER BY
	e.s_id ASC,
	t.r_date ASC
;

■返却値
mysql> # 対象のテーブルから社員コード、氏名、日付を出力
mysql> SELECT
    -> e.s_id AS 社員コード,
    -> CONCAT(e.l_name, e.f_name) AS 氏名,
    -> t.r_date AS 日付
    -> # 対象のテーブルは社員テーブルにタイムカードテーブルを内部結合したもの
    -> FROM
    -> employee AS e
    -> INNER JOIN
    -> time_card AS t
    -> # 社員テーブルにタイムカードテーブルを内部結合する条件は社員コードが一致すること
    -> ON
    -> e.s_id = t.s_id
    -> # 日付が2012年12月のデータのみ出力
    -> WHERE
    -> t.r_date >= '2012-12-01' AND  t.r_date <= '2012-12-31'
    -> # 社員コード、日付について昇順で出力
    -> ORDER BY
    -> e.s_id ASC,
    -> t.r_date ASC
    -> ;
+------------+------------+------------+
| 社員コード | 氏名       | 日付       |
+------------+------------+------------+
| DA00001    | 大門一郎   | 2012-12-01 |
| DA00001    | 大門一郎   | 2012-12-02 |
| DA00001    | 大門一郎   | 2012-12-05 |
| DA00001    | 大門一郎   | 2012-12-06 |
| DA00001    | 大門一郎   | 2012-12-07 |
| DA00001    | 大門一郎   | 2012-12-08 |
| DA00001    | 大門一郎   | 2012-12-09 |
| DA00001    | 大門一郎   | 2012-12-12 |
| DA00001    | 大門一郎   | 2012-12-13 |
| DA00001    | 大門一郎   | 2012-12-14 |
| DA00001    | 大門一郎   | 2012-12-15 |
| DA00001    | 大門一郎   | 2012-12-16 |
| DA00001    | 大門一郎   | 2012-12-19 |
| DA00001    | 大門一郎   | 2012-12-20 |
| DA00001    | 大門一郎   | 2012-12-21 |
| DA00001    | 大門一郎   | 2012-12-22 |
| DA00001    | 大門一郎   | 2012-12-23 |
| DA00001    | 大門一郎   | 2012-12-26 |
| DA00001    | 大門一郎   | 2012-12-27 |
| DA00001    | 大門一郎   | 2012-12-28 |
| FU00001    | 藤井雄太   | 2012-12-01 |
| FU00001    | 藤井雄太   | 2012-12-02 |
| FU00001    | 藤井雄太   | 2012-12-05 |
| FU00001    | 藤井雄太   | 2012-12-06 |
| FU00001    | 藤井雄太   | 2012-12-07 |
| FU00001    | 藤井雄太   | 2012-12-08 |
| FU00001    | 藤井雄太   | 2012-12-09 |
| FU00001    | 藤井雄太   | 2012-12-12 |
| FU00001    | 藤井雄太   | 2012-12-13 |
| FU00001    | 藤井雄太   | 2012-12-14 |
| FU00001    | 藤井雄太   | 2012-12-15 |
| FU00001    | 藤井雄太   | 2012-12-16 |
| FU00001    | 藤井雄太   | 2012-12-19 |
| FU00001    | 藤井雄太   | 2012-12-20 |
| FU00001    | 藤井雄太   | 2012-12-21 |
| FU00001    | 藤井雄太   | 2012-12-22 |
| FU00001    | 藤井雄太   | 2012-12-23 |
| FU00001    | 藤井雄太   | 2012-12-26 |
| FU00001    | 藤井雄太   | 2012-12-27 |
| FU00001    | 藤井雄太   | 2012-12-28 |
| FU00002    | 藤岡幸太郎 | 2012-12-01 |
| FU00002    | 藤岡幸太郎 | 2012-12-02 |
| FU00002    | 藤岡幸太郎 | 2012-12-05 |
| FU00002    | 藤岡幸太郎 | 2012-12-06 |
| FU00002    | 藤岡幸太郎 | 2012-12-07 |
| FU00002    | 藤岡幸太郎 | 2012-12-08 |
| FU00002    | 藤岡幸太郎 | 2012-12-09 |
| FU00002    | 藤岡幸太郎 | 2012-12-12 |
| FU00002    | 藤岡幸太郎 | 2012-12-13 |
| FU00002    | 藤岡幸太郎 | 2012-12-14 |
| FU00002    | 藤岡幸太郎 | 2012-12-15 |
| FU00002    | 藤岡幸太郎 | 2012-12-16 |
| FU00002    | 藤岡幸太郎 | 2012-12-19 |
| FU00002    | 藤岡幸太郎 | 2012-12-20 |
| FU00002    | 藤岡幸太郎 | 2012-12-21 |
| FU00002    | 藤岡幸太郎 | 2012-12-22 |
| FU00002    | 藤岡幸太郎 | 2012-12-23 |
| FU00002    | 藤岡幸太郎 | 2012-12-26 |
| FU00002    | 藤岡幸太郎 | 2012-12-27 |
| FU00002    | 藤岡幸太郎 | 2012-12-28 |
| HA0002     | 葉山俊輔   | 2012-12-01 |
| HA0002     | 葉山俊輔   | 2012-12-02 |
| HA0002     | 葉山俊輔   | 2012-12-05 |
| HA0002     | 葉山俊輔   | 2012-12-06 |
| HA0002     | 葉山俊輔   | 2012-12-07 |
| HA0002     | 葉山俊輔   | 2012-12-08 |
| HA0002     | 葉山俊輔   | 2012-12-09 |
| HA0002     | 葉山俊輔   | 2012-12-12 |
| HA0002     | 葉山俊輔   | 2012-12-13 |
| HA0002     | 葉山俊輔   | 2012-12-14 |
| HA0002     | 葉山俊輔   | 2012-12-15 |
| HA0002     | 葉山俊輔   | 2012-12-16 |
| HA0002     | 葉山俊輔   | 2012-12-19 |
| HA0002     | 葉山俊輔   | 2012-12-20 |
| HA0002     | 葉山俊輔   | 2012-12-21 |
| HA0002     | 葉山俊輔   | 2012-12-22 |
| HA0002     | 葉山俊輔   | 2012-12-23 |
| HA0002     | 葉山俊輔   | 2012-12-26 |
| HA0002     | 葉山俊輔   | 2012-12-27 |
| HA0002     | 葉山俊輔   | 2012-12-28 |
| KA00001    | 川口裕子   | 2012-12-01 |
| KA00001    | 川口裕子   | 2012-12-02 |
| KA00001    | 川口裕子   | 2012-12-05 |
| KA00001    | 川口裕子   | 2012-12-06 |
| KA00001    | 川口裕子   | 2012-12-07 |
| KA00001    | 川口裕子   | 2012-12-08 |
| KA00001    | 川口裕子   | 2012-12-09 |
| KA00001    | 川口裕子   | 2012-12-12 |
| KA00001    | 川口裕子   | 2012-12-13 |
| KA00001    | 川口裕子   | 2012-12-14 |
| KA00001    | 川口裕子   | 2012-12-15 |
| KA00001    | 川口裕子   | 2012-12-16 |
| KA00001    | 川口裕子   | 2012-12-19 |
| KA00001    | 川口裕子   | 2012-12-20 |
| KA00001    | 川口裕子   | 2012-12-21 |
| KA00001    | 川口裕子   | 2012-12-22 |
| KA00001    | 川口裕子   | 2012-12-23 |
| KA00001    | 川口裕子   | 2012-12-26 |
| KA00001    | 川口裕子   | 2012-12-27 |
| KA00001    | 川口裕子   | 2012-12-28 |
| KA00002    | 加藤昭雄   | 2012-12-01 |
| KA00002    | 加藤昭雄   | 2012-12-02 |
| KA00002    | 加藤昭雄   | 2012-12-05 |
| KA00002    | 加藤昭雄   | 2012-12-06 |
| KA00002    | 加藤昭雄   | 2012-12-07 |
| KA00002    | 加藤昭雄   | 2012-12-08 |
| KA00002    | 加藤昭雄   | 2012-12-09 |
| KA00002    | 加藤昭雄   | 2012-12-12 |
| KA00002    | 加藤昭雄   | 2012-12-13 |
| KA00002    | 加藤昭雄   | 2012-12-14 |
| KA00002    | 加藤昭雄   | 2012-12-15 |
| KA00002    | 加藤昭雄   | 2012-12-16 |
| KA00002    | 加藤昭雄   | 2012-12-19 |
| KA00002    | 加藤昭雄   | 2012-12-20 |
| KA00002    | 加藤昭雄   | 2012-12-21 |
| KA00002    | 加藤昭雄   | 2012-12-22 |
| KA00002    | 加藤昭雄   | 2012-12-23 |
| KA00002    | 加藤昭雄   | 2012-12-26 |
| KA00002    | 加藤昭雄   | 2012-12-27 |
| KA00002    | 加藤昭雄   | 2012-12-28 |
| KA00003    | 神田佐知子 | 2012-12-01 |
| KA00003    | 神田佐知子 | 2012-12-02 |
| KA00003    | 神田佐知子 | 2012-12-05 |
| KA00003    | 神田佐知子 | 2012-12-06 |
| KA00003    | 神田佐知子 | 2012-12-07 |
| KA00003    | 神田佐知子 | 2012-12-08 |
| KA00003    | 神田佐知子 | 2012-12-09 |
| KA00003    | 神田佐知子 | 2012-12-12 |
| KA00003    | 神田佐知子 | 2012-12-13 |
| KA00003    | 神田佐知子 | 2012-12-14 |
| KA00003    | 神田佐知子 | 2012-12-15 |
| KA00003    | 神田佐知子 | 2012-12-16 |
| KA00003    | 神田佐知子 | 2012-12-19 |
| KA00003    | 神田佐知子 | 2012-12-20 |
| KA00003    | 神田佐知子 | 2012-12-21 |
| KA00003    | 神田佐知子 | 2012-12-22 |
| KA00003    | 神田佐知子 | 2012-12-23 |
| KA00003    | 神田佐知子 | 2012-12-26 |
| KA00003    | 神田佐知子 | 2012-12-27 |
| KA00003    | 神田佐知子 | 2012-12-28 |
| KI00001    | 木村一郎   | 2012-12-01 |
| KI00001    | 木村一郎   | 2012-12-02 |
| KI00001    | 木村一郎   | 2012-12-05 |
| KI00001    | 木村一郎   | 2012-12-06 |
| KI00001    | 木村一郎   | 2012-12-07 |
| KI00001    | 木村一郎   | 2012-12-08 |
| KI00001    | 木村一郎   | 2012-12-09 |
| KI00001    | 木村一郎   | 2012-12-12 |
| KI00001    | 木村一郎   | 2012-12-13 |
| KI00001    | 木村一郎   | 2012-12-14 |
| KI00001    | 木村一郎   | 2012-12-15 |
| KI00001    | 木村一郎   | 2012-12-16 |
| KI00001    | 木村一郎   | 2012-12-19 |
| KI00001    | 木村一郎   | 2012-12-20 |
| KI00001    | 木村一郎   | 2012-12-21 |
| KI00001    | 木村一郎   | 2012-12-22 |
| KI00001    | 木村一郎   | 2012-12-23 |
| KI00001    | 木村一郎   | 2012-12-26 |
| KI00001    | 木村一郎   | 2012-12-27 |
| KI00001    | 木村一郎   | 2012-12-28 |
| NA00001    | 中澤康代   | 2012-12-01 |
| NA00001    | 中澤康代   | 2012-12-02 |
| NA00001    | 中澤康代   | 2012-12-05 |
| NA00001    | 中澤康代   | 2012-12-06 |
| NA00001    | 中澤康代   | 2012-12-07 |
| NA00001    | 中澤康代   | 2012-12-08 |
| NA00001    | 中澤康代   | 2012-12-09 |
| NA00001    | 中澤康代   | 2012-12-12 |
| NA00001    | 中澤康代   | 2012-12-13 |
| NA00001    | 中澤康代   | 2012-12-14 |
| NA00001    | 中澤康代   | 2012-12-15 |
| NA00001    | 中澤康代   | 2012-12-16 |
| NA00001    | 中澤康代   | 2012-12-19 |
| NA00001    | 中澤康代   | 2012-12-20 |
| NA00001    | 中澤康代   | 2012-12-21 |
| NA00001    | 中澤康代   | 2012-12-22 |
| NA00001    | 中澤康代   | 2012-12-23 |
| NA00001    | 中澤康代   | 2012-12-26 |
| NA00001    | 中澤康代   | 2012-12-27 |
| NA00001    | 中澤康代   | 2012-12-28 |
| NO00001    | 野上利江   | 2012-12-01 |
| NO00001    | 野上利江   | 2012-12-02 |
| NO00001    | 野上利江   | 2012-12-05 |
| NO00001    | 野上利江   | 2012-12-06 |
| NO00001    | 野上利江   | 2012-12-07 |
| NO00001    | 野上利江   | 2012-12-08 |
| NO00001    | 野上利江   | 2012-12-09 |
| NO00001    | 野上利江   | 2012-12-12 |
| NO00001    | 野上利江   | 2012-12-13 |
| NO00001    | 野上利江   | 2012-12-14 |
| NO00001    | 野上利江   | 2012-12-15 |
| NO00001    | 野上利江   | 2012-12-16 |
| NO00001    | 野上利江   | 2012-12-19 |
| NO00001    | 野上利江   | 2012-12-20 |
| NO00001    | 野上利江   | 2012-12-21 |
| NO00001    | 野上利江   | 2012-12-22 |
| NO00001    | 野上利江   | 2012-12-23 |
| NO00001    | 野上利江   | 2012-12-26 |
| NO00001    | 野上利江   | 2012-12-27 |
| NO00001    | 野上利江   | 2012-12-28 |
| SI00001    | 清水春子   | 2012-12-01 |
| SI00001    | 清水春子   | 2012-12-02 |
| SI00001    | 清水春子   | 2012-12-05 |
| SI00001    | 清水春子   | 2012-12-06 |
| SI00001    | 清水春子   | 2012-12-07 |
| SI00001    | 清水春子   | 2012-12-08 |
| SI00001    | 清水春子   | 2012-12-09 |
| SI00001    | 清水春子   | 2012-12-12 |
| SI00001    | 清水春子   | 2012-12-13 |
| SI00001    | 清水春子   | 2012-12-14 |
| SI00001    | 清水春子   | 2012-12-15 |
| SI00001    | 清水春子   | 2012-12-16 |
| SI00001    | 清水春子   | 2012-12-19 |
| SI00001    | 清水春子   | 2012-12-20 |
| SI00001    | 清水春子   | 2012-12-21 |
| SI00001    | 清水春子   | 2012-12-22 |
| SI00001    | 清水春子   | 2012-12-23 |
| SI00001    | 清水春子   | 2012-12-26 |
| SI00001    | 清水春子   | 2012-12-27 |
| SI00001    | 清水春子   | 2012-12-28 |
| TA00001    | 田中真由子 | 2012-12-01 |
| TA00001    | 田中真由子 | 2012-12-02 |
| TA00001    | 田中真由子 | 2012-12-05 |
| TA00001    | 田中真由子 | 2012-12-06 |
| TA00001    | 田中真由子 | 2012-12-07 |
| TA00001    | 田中真由子 | 2012-12-08 |
| TA00001    | 田中真由子 | 2012-12-09 |
| TA00001    | 田中真由子 | 2012-12-12 |
| TA00001    | 田中真由子 | 2012-12-13 |
| TA00001    | 田中真由子 | 2012-12-14 |
| TA00001    | 田中真由子 | 2012-12-15 |
| TA00001    | 田中真由子 | 2012-12-16 |
| TA00001    | 田中真由子 | 2012-12-19 |
| TA00001    | 田中真由子 | 2012-12-20 |
| TA00001    | 田中真由子 | 2012-12-21 |
| TA00001    | 田中真由子 | 2012-12-22 |
| TA00001    | 田中真由子 | 2012-12-23 |
| TA00001    | 田中真由子 | 2012-12-26 |
| TA00001    | 田中真由子 | 2012-12-27 |
| TA00001    | 田中真由子 | 2012-12-28 |
| TA00002    | 田辺正一   | 2012-12-01 |
| TA00002    | 田辺正一   | 2012-12-02 |
| TA00002    | 田辺正一   | 2012-12-05 |
| TA00002    | 田辺正一   | 2012-12-06 |
| TA00002    | 田辺正一   | 2012-12-07 |
| TA00002    | 田辺正一   | 2012-12-08 |
| TA00002    | 田辺正一   | 2012-12-09 |
| TA00002    | 田辺正一   | 2012-12-12 |
| TA00002    | 田辺正一   | 2012-12-13 |
| TA00002    | 田辺正一   | 2012-12-14 |
| TA00002    | 田辺正一   | 2012-12-15 |
| TA00002    | 田辺正一   | 2012-12-16 |
| TA00002    | 田辺正一   | 2012-12-19 |
| TA00002    | 田辺正一   | 2012-12-20 |
| TA00002    | 田辺正一   | 2012-12-21 |
| TA00002    | 田辺正一   | 2012-12-22 |
| TA00002    | 田辺正一   | 2012-12-23 |
| TA00002    | 田辺正一   | 2012-12-26 |
| TA00002    | 田辺正一   | 2012-12-27 |
| TA00002    | 田辺正一   | 2012-12-28 |
| TO00002    | 戸川よしみ | 2012-12-01 |
| TO00002    | 戸川よしみ | 2012-12-02 |
| TO00002    | 戸川よしみ | 2012-12-05 |
| TO00002    | 戸川よしみ | 2012-12-06 |
| TO00002    | 戸川よしみ | 2012-12-07 |
| TO00002    | 戸川よしみ | 2012-12-08 |
| TO00002    | 戸川よしみ | 2012-12-09 |
| TO00002    | 戸川よしみ | 2012-12-12 |
| TO00002    | 戸川よしみ | 2012-12-13 |
| TO00002    | 戸川よしみ | 2012-12-14 |
| TO00002    | 戸川よしみ | 2012-12-15 |
| TO00002    | 戸川よしみ | 2012-12-16 |
| TO00002    | 戸川よしみ | 2012-12-19 |
| TO00002    | 戸川よしみ | 2012-12-20 |
| TO00002    | 戸川よしみ | 2012-12-21 |
| TO00002    | 戸川よしみ | 2012-12-22 |
| TO00002    | 戸川よしみ | 2012-12-23 |
| TO00002    | 戸川よしみ | 2012-12-26 |
| TO00002    | 戸川よしみ | 2012-12-27 |
| TO00002    | 戸川よしみ | 2012-12-28 |
| TU00001    | 津村知美   | 2012-12-01 |
| TU00001    | 津村知美   | 2012-12-02 |
| TU00001    | 津村知美   | 2012-12-05 |
| TU00001    | 津村知美   | 2012-12-06 |
| TU00001    | 津村知美   | 2012-12-07 |
| TU00001    | 津村知美   | 2012-12-08 |
| TU00001    | 津村知美   | 2012-12-09 |
| TU00001    | 津村知美   | 2012-12-12 |
| TU00001    | 津村知美   | 2012-12-13 |
| TU00001    | 津村知美   | 2012-12-14 |
| TU00001    | 津村知美   | 2012-12-15 |
| TU00001    | 津村知美   | 2012-12-16 |
| TU00001    | 津村知美   | 2012-12-19 |
| TU00001    | 津村知美   | 2012-12-20 |
| TU00001    | 津村知美   | 2012-12-21 |
| TU00001    | 津村知美   | 2012-12-22 |
| TU00001    | 津村知美   | 2012-12-23 |
| TU00001    | 津村知美   | 2012-12-26 |
| TU00001    | 津村知美   | 2012-12-27 |
| TU00001    | 津村知美   | 2012-12-28 |
+------------+------------+------------+
300 rows in set (0.04 sec)
mysql>