■問題文
書籍情報テーブル（books）を以下の要領で一括更新したいと思います。
空欄を埋めて正しいSQL命令を完成させてみましょう。
-----------------------------------------------------------
・ISBNコードの先頭に、固定値で「ISBN」を追加
・消費税込みの価格情報を税抜き価格に変更
-----------------------------------------------------------
[空欄①]
	books
SET
	[空欄②],
	[空欄③]
;

■実行文
# 著者情報テーブルを更新する
UPDATE
	books
SET
# ISBNコードの先頭に、固定値で「ISBN」を追加する
	isbn = CONCAT('ISBN', isbn),
# 消費税込みの価格情報を税抜き価格に変更する
	price = price / 1.1
;

■確認
mysql> UPDATE
    -> books
    -> SET
    -> isbn = CONCAT('ISBN', isbn),
    -> price = price / 1.1
    -> ;
Query OK, 15 rows affected (0.03 sec)
Rows matched: 15  Changed: 15  Warnings: 0

【Before】
mysql> select isbn,price from books;
+---------------+-------+
| isbn          | price |
+---------------+-------+
| 4-0010-0000-0 |   900 |
| 4-0010-0000-1 |  5100 |
| 4-0010-0000-4 |  1000 |
| 4-0010-0000-5 |  1100 |
| 4-0010-0000-6 |   700 |
| 4-0010-0000-7 |   800 |
| 4-0010-0000-9 |  5500 |
| 4-7980-0522-3 |  1800 |
| 4-7980-0945-8 |  3000 |
| 4-7981-0722-0 |  3300 |
| 4-7981-0959-2 |  3000 |
| 4-8833-0000-1 |  2500 |
| 4-8833-0000-2 |  1600 |
| 4-8833-0000-3 |  3200 |
| 4-8833-0000-4 |  1000 |
+---------------+-------+
15 rows in set (0.00 sec)

【After】
mysql> select isbn,price from books;
+-------------------+-------+
| isbn              | price |
+-------------------+-------+
| ISBN4-0010-0000-0 |   818 |
| ISBN4-0010-0000-1 |  4636 |
| ISBN4-0010-0000-4 |   909 |
| ISBN4-0010-0000-5 |  1000 |
| ISBN4-0010-0000-6 |   636 |
| ISBN4-0010-0000-7 |   727 |
| ISBN4-0010-0000-9 |  5000 |
| ISBN4-7980-0522-3 |  1636 |
| ISBN4-7980-0945-8 |  2727 |
| ISBN4-7981-0722-0 |  3000 |
| ISBN4-7981-0959-2 |  2727 |
| ISBN4-8833-0000-1 |  2273 |
| ISBN4-8833-0000-2 |  1455 |
| ISBN4-8833-0000-3 |  2909 |
| ISBN4-8833-0000-4 |   909 |
+-------------------+-------+
15 rows in set (0.00 sec)