■問題文
問１でISBNコードの先頭に付与した固定文字列「ISBN」を一律取り除いてみましょう。
対応するためのSQL命令を記述してみましょう。

■実行文
# 書籍情報テーブルを更新する
UPDATE
	books
# ISBNコードの固定文字列「ISBN」を一律取り除いて更新する
SET
	isbn = REPLACE(isbn, 'ISBN', '')
;

■確認
mysql> # 書籍情報テーブルを更新する
mysql> UPDATE
    -> books
    -> # ISBNコードの固定文字列「ISBN」を一律取り除いて更新する
    -> SET
    -> isbn = REPLACE(isbn, 'ISBN', '')
    -> ;
Query OK, 15 rows affected (0.06 sec)
Rows matched: 15  Changed: 15  Warnings: 0

【Before】
mysql> select isbn from books;
+-------------------+
| isbn              |
+-------------------+
| ISBN4-0010-0000-0 |
| ISBN4-0010-0000-1 |
| ISBN4-0010-0000-4 |
| ISBN4-0010-0000-5 |
| ISBN4-0010-0000-6 |
| ISBN4-0010-0000-7 |
| ISBN4-0010-0000-9 |
| ISBN4-7980-0522-3 |
| ISBN4-7980-0945-8 |
| ISBN4-7981-0722-0 |
| ISBN4-7981-0959-2 |
| ISBN4-8833-0000-1 |
| ISBN4-8833-0000-2 |
| ISBN4-8833-0000-3 |
| ISBN4-8833-0000-4 |
+-------------------+
15 rows in set (0.00 sec)

【After】
mysql> select isbn from books;
+---------------+
| isbn          |
+---------------+
| 4-0010-0000-0 |
| 4-0010-0000-1 |
| 4-0010-0000-4 |
| 4-0010-0000-5 |
| 4-0010-0000-6 |
| 4-0010-0000-7 |
| 4-0010-0000-9 |
| 4-7980-0522-3 |
| 4-7980-0945-8 |
| 4-7981-0722-0 |
| 4-7981-0959-2 |
| 4-8833-0000-1 |
| 4-8833-0000-2 |
| 4-8833-0000-3 |
| 4-8833-0000-4 |
+---------------+
15 rows in set (0.00 sec)