■問題
月間売上テーブル（sales）で、店舗別の累計売上高を算出するためのSQL命令を記述してみましょう。

■実行文
# 店舗ごとの累計売上高を取得
SELECT
	s_id,
	SUM(s_value)
# 月間売上テーブルから取得
FROM
	sales
# 店舗ごとに取得
GROUP BY
	s_id
;

■返却値
mysql> SELECT
    -> s_id,
    -> SUM(s_value)
    -> FROM
    -> sales
    -> GROUP BY
    -> s_id
    -> ;
+-------+--------------+
| s_id  | SUM(s_value) |
+-------+--------------+
| H0001 |        19836 |
| K0001 |        21376 |
| K0002 |        20580 |
| M0001 |        21929 |
| M0002 |        12032 |
| N0001 |        20988 |
+-------+--------------+
6 rows in set (0.01 sec)